---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SpecTypeId..::..Reference Properties
SpecTypeId..::..Reference Class See Also Send Feedback
---

The SpecTypeId..::..Reference type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | FillPattern | Fill Pattern, in discipline Common. |
|  | Image | Image, in discipline Common. |
|  | LoadClassification | Load Classification, in discipline Electrical. |
|  | Material | Material, in discipline Common. |

# See Also

SpecTypeId..::..Reference Class

Autodesk.Revit.DB Namespace